In [14]:
import pandas as pd
import requests

In [3]:
auction_data = pd.read_csv("IPLPlayerAuctionData.csv")

In [4]:
auction_data.head()

,Player,Role,Amount,Team,Year,Player Origin
0,Aaron Finch,Batsman,40000000,Sunrisers Hyderabad,2014.0,Overseas
1,Aaron Finch,Batsman,32000000,Mumbai Indians,2015.0,Overseas
2,Aaron Finch,Batsman,10000000,Gujarat Lions,2016.0,Overseas
3,Aaron Finch,Batsman,62000000,Kings XI Punjab,2018.0,Overseas
4,Aaron Finch,Batsman,44000000,Royal Challengers Bangalore,2020.0,Overseas

In [5]:
auction_data.rename(columns={'Amount': 'Amount(INR)'}, inplace=True)

In [6]:
auction_data["Amount_CR(INR)"] = auction_data['Amount(INR)']/1e7

In [7]:
auction_data.head()

,Player,Role,Amount(INR),Team,Year,Player Origin,Amount_CR(INR)
0,Aaron Finch,Batsman,40000000,Sunrisers Hyderabad,2014.0,Overseas,4.0
1,Aaron Finch,Batsman,32000000,Mumbai Indians,2015.0,Overseas,3.2
2,Aaron Finch,Batsman,10000000,Gujarat Lions,2016.0,Overseas,1.0
3,Aaron Finch,Batsman,62000000,Kings XI Punjab,2018.0,Overseas,6.2
4,Aaron Finch,Batsman,44000000,Royal Challengers Bangalore,2020.0,Overseas,4.4

In [8]:
auction_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 970 entries, 0 to 969
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Player          970 non-null    object
 1   Role            970 non-null    object
 2   Amount(INR)     970 non-null    int64
 3   Team            970 non-null    object
 4   Year            969 non-null    float64
 5   Player Origin   970 non-null    object
 6   Amount_CR(INR)  970 non-null    float64
dtypes: float64(2), int64(1), object(4)
memory usage: 53.2+ KB

In [9]:
auction_data[auction_data["Year"].isnull()]

,Player,Role,Amount(INR),Team,Year,Player Origin,Amount_CR(INR)
313,Ishan Porel,Bowler,2000000,Kings XI Punjab,NaN,Indian,0.2

In [10]:
auction_data[auction_data['Player']=='Ishan Porel']

,Player,Role,Amount(INR),Team,Year,Player Origin,Amount_CR(INR)
312,Ishan Porel,Bowler,2500000,Punjab Kings,2022.0,Indian,0.25
313,Ishan Porel,Bowler,2000000,Kings XI Punjab,NaN,Indian,0.20

In [11]:
auction_data.loc[auction_data['Year'].isnull(), 'Year'] = 2020
auction_data['Year'] = auction_data['Year'].astype(int)

In [12]:
auction_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 970 entries, 0 to 969
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Player          970 non-null    object
 1   Role            970 non-null    object
 2   Amount(INR)     970 non-null    int64
 3   Team            970 non-null    object
 4   Year            970 non-null    int64
 5   Player Origin   970 non-null    object
 6   Amount_CR(INR)  970 non-null    float64
dtypes: float64(1), int64(2), object(4)
memory usage: 53.2+ KB

In [13]:
auction_data[auction_data['Player']=='Virat Kohli']

Empty DataFrame
Columns: [Player, Role, Amount(INR), Team, Year, Player Origin, Amount_CR(INR)]
Index: []